[
"Miss Elise.",
"It... It's alright. We give thanks for the blessed flames. May we always continue to have peace. Sun of Soleanna, guide and watch over us with your eternal light...",
"A pleasure to meet you at last, Princess of Soleanna. I am Dr. Eggman. I've come here to obtain the secret of the Flames of Disaster from you. [Eggman then points to the blue Chaos Emerald that Elise clutches in her hand, which she then presses tightly against her chest in terrified fear.] And to take the miracle gems that are the keys to its secret... The Chaos Emerald! Now Princess, this way please.",
"My... That's a pretty snazzy performance there.",
"You... [Elise visualizes Silver the Hedgehog in Sonic's place.] It can't be?",
"I'm Sonic. Sonic The Hedgehog! [Scoops up Elise in his arms and runs off.]",
"Not that irritating hedgehog again! Attack!",
"I finally found him... the Iblis Trigger!",
"Umm... Why are you helping me?",
"No special reason. [Jumps over a canal]",
"Sonic!",
"I'm afraid our little game ends now.",
"[Wriggles an arm free] Sonic, take this!",
"I've got it! And don't worry, I'll rescue you!",
"I know.",
"[scoffs] It's only a matter of time before it's mine. Until then, you can hold onto it for me!",
"Sonic!",
"Tails! Long time no see!",
"I'm glad that you're here. I heard that you tried to save the Princess from Dr. Eggman. You're going to rescue her, aren't you? Let me help. I may not know what Eggman's up to, but it can't be a good thing!",
"OK! With your help, this should be a piece of cake. [Runs off]",
"Heh heh. I'll do my best! [Follows Sonic]",
"It looks like the Princess was moved into another location. [Walks around Sonic, while Sonic looks at a feather.] Let's head back to the city!",
"You're a good girl, Elise. Remember, be brave. Don't cry no matter what happens.",
"Mr. Sonic!",
"Just call me Sonic. [Elise hugs Sonic.] Now then, are you OK?",
"I-I'm so glad that you came...",
"I always keep my word.",
"Sonic!",
"It looks like a pesky rat has stuck its nose where it doesn't belong. Well, a hedgehog to be more precise... The Princess is mine until I unlock the secret of the Flames of Disaster.",
"Tails!",
"Got it! Let's go!",
"How long is this going to go on?",
"Let's split up. I'll get their attention, and you take the Princess.",
"Leave it to me!",
"Hold on tight!",
"Ok!",
"I have no words to express how grateful I am for your help... [Pauses and notices Sonic having a cut in his arm.] You're hurt!",
"It's nothing.",
"Don't say that. [Elise then uses some fabrics as a bandage to cover the injury.] I'm sorry. It's all my fault...",
"Smile. [Sonic then waves his index finger. A butterfly flies towards his nose and Elise smiles. Elise lightly flicks the butterfly and it flies away.] Your smile... That's all I need.",
"Eggman mentioned the Flames of Disaster. Is that why he's after you?",
"Yes. The name of the sun god our country honors is Solaris... [A flashback of the festival plays in the background.] It is told that Solaris's rage would destroy the world. [The background shifts to Elise's vision of Iblis from before.] His wrath comes in the form of the Flames of Disaster. [Background returns to normal.] 10 years ago, we almost faced the full force of his fury... I was a child then, so I don't remember it very well. I lost my father then... [An image of Eggman looking over his shoulder at the camera appears as Elise continues] And now that man is trying to cause the same disaster again... [Back to her and Sonic with the sky and ground around them] What can I do? [Pause, then Sonic grabs Elise's hand and runs together.] Sonic? Sonic! Sonic, wait! I can't run that fast!",
"Don't worry. Just raise your head and run! [They continuing running. It then fades into another scene] Feels great, doesn't it?",
"Yes. I-I've never run so fast before...",
"Nothing starts until you take action. If you have time to worry, then run!",
"I've been looking for you. You're the Iblis Trigger. Your actions will condemn us all.",
"Who are you?",
"My name is Silver. For the future of the world, I will destroy you!",
"Hey.",
"Hmph! Is this a joke? How could someone like you cause the destruction of our world?",
"What do you...mean?",
"It doesn't matter. For the sake of the future, the Iblis Trigger must be destroyed!",
"Elise!? Wait!",
"Don't you dare turn your back on me! It's time I finally put an end to this!",
"Stop!",
"Amy? Get out of my way, Amy! This is my mission!",
"Absolutely not!",
"Thanks Amy. I appreciate it.",
"Leave it to me.",
"Knuckles.",
"I saw Eggman on the outskirts of the city. [Throws the card to Sonic.] He wanted to give this to you.",
"Sonic the Hedgehog. If you want me to return the Princess, you must give me your Chaos Emerald. Meet me at my base in White Acropolis.",
"Huh. He's pretty cocky. [Crushes the card]",
"It's most definitely a trap. I don't think Eggman will honor his agreement.",
"[Looks at his Chaos Emerald.] I'm going.",
"Sonic?",
"Since Eggman went to the trouble of telling me where Elise is. I think I should thank him personally.",
"You're late.",
"Well, we had to deal with your little pets.",
"Where's Elise?",
"My, aren't we impatient...",
"Sonic!",
"Ah ah. You better not move. Now, the Chaos Emerald... [Sonic takes his Chaos emerald out.] Place it there. [Eggman points to a capsule that rises from the ground while Elise shakes her head. Sonic places the Emerald in the capsule and it recedes back into the ground. Eggman smiles wickedly before he then presses a button on a control panel next to him.] Hmph!",
"Huh!? Wha-!?",
"Wha!?",
"It's no use. It's too powerful for you to overcome. Now allow me to introduce you to my latest creation. This is the Solaris prototype. [Elise gasps while Eggman laughs and pulls a handle on a nearby control podium.] With this machine, I'll be able to control the flow of time itself!",
"Whooah!",
"Ahhhhh!",
"Arrrrrhhhh!",
"Rest assured... They're not dead... yet. They've just been teleported by my glorious invention to another time. Who knows where they'll end up? It could be the distant past or far future. But my machine still requires some fine-tuning. In fact, what my machine needs in order to be complete, is your power.",
"My power?",
"Yes, I can finally complete my plans... Now that I have the Chaos Emeralds, and you... The Princess of Soleanna. That's all I need to revive the Flames of Disaster. And with its power, I will be able to control everything and rule the world. So, you would be wise to remain on my \"good\" side.",
"Boy, do I feel dizzy... [Looks around] Where are we?",
"Oh, look who's here! I didn't expect to see you guys.",
"Rouge! Shadow!",
"Hi. Long time no see!",
"This is the distant future, far removed from our own timeline.",
"The future? Then that means Eggman's machine can control time!",
"Eggman's got some nerve dropping us here.",
"[Kicks a rock] Now, how can we get back to our own time?",
"You need a space-time rift, but this requires a lot of energy.",
"I see. You mean using your Chaos Control will...",
"Yes, but that alone is insufficient.",
"Okay Shadow. It looks like we need to work together.",
"No matter where we go, all we see are ruins. How can this be our future?",
"How could it come to this?",
"Could it be true? [Mephiles (under Shadow's appearance), Silver, and Blaze can be seen standing in front of a large database computer.] If I eliminate that guy, will our world be saved?",
"[Nods.] The Day of Disaster... Here are my records of this event. This was when Iblis was freed and his flames were released into the world. [Mephiles presses a key. The screen then displayed screenshots from the present timeline.] And you have this person to blame.",
"I see it! So, That blue hedgehog's the Iblis Trigger?",
"Blue hedgehog...",
"I'll send us back in time to the point when the Iblis Trigger was alive.",
"What the... Who was that guy? He looked just like Shadow...",
"Th-This is terrible! [Types on the keys.] According to the data, the Princess died when she was kidnapped by Eggman! Apparently Eggman's battleship exploded! [Types on the keys.] The date of this incident was... two days after the Festival of the Sun!",
"If we don't return in time, Elise will die onboard Eggman's battleship. That means...",
"Yeah... I think so.",
"You guys are so slow. Look.",
"A Chaos Emerald! You've already found one!",
"Well now... I may not look It, but I'm a real treasure hunter. Unlike a certain echidna I know.",
"[Gets up in Rouge's face] What? [Scoffs and walks away]",
"Have you guys discovered anything?",
"Um, yeah. [Points into the distance] I received a signal indicating there's a Chaos Emerald here, but...",
"You mean we've got to go through there?",
"[Gets up in Rouge's face] If you don't like it, you can stay here.",
"You've got to be kidding!",
"Don't be late.",
"[Walks away] Same to you.",
"I've found a Chaos Emerald!",
"Don't touch it!",
"What? What's this?",
"Chaos Control!",
"Oww...",
"Looks like we make it back in one piece.",
"Where did Shadow and Rouge go? Did they appear someplace else?",
"Those two can take care of themselves.",
"I knew it... I knew you'd return! You had to!",
"...You again.",
"This time there will be no more interruptions! The Iblis Trigger... must die!",
"Sonic...",
"So how was your little walk, Princess? [The Egg Mobile appears and grabs Elise with its two hands before flying away. Elise cries out in fear as she's grabbed.]",
"Elise!",
"[Strengths his hold on Sonic] It's time to end this!",
"Who? Mephiles! Why are you getting in my way?",
"I'm Shadow. Shadow The Hedgehog.",
"Now stop it. You have no where to go.",
"I would rather die than be your prisoner again!",
"Hmph! So, what are you going to do, Princess? Do you plan to jump?",
"Farewell.",
"Huh?",
"Sonic!",
"(growls) You won't get away that easily!",
"That was a gutsy move back there!",
"Well, I was desperate... and um... I just had to get away. I owe you a lot, Sonic...",
"Uh... [Sonic turns to see a large hoard of Egg Gunners flying towards his direction.] I'll head into the jungle!",
"OK!",
"It looks like we've lost them.",
"I'll settle things here. Elise, you should go back to the castle.",
"OK... [Sonic makes a turn to the right.] Sonic? [They stop by a lake surrounded by green grass and numerous trees.] It's so beautiful! I've never seen so many flowers before! Sonic, have you visited many wonderful places before?",
"Yeah.",
"Once you defeat Eggman... you'll leave, won't you? [Sonic nods] Though I've been frightened many times, I've also enjoyed this adventure. It allowed me to be something other than a Princess. I was able to be myself... a girl.",
"It sounds like being a Princess isn't that easy.",
"It isn't sometimes, but I love this country. Everyone in the castle, the children, all my citizens really... The same love my late father and mother had...",
"Don't cry, Elise. Become a strong queen who doesn't cry no matter what happens.",
"And so, I do my best to protect my country. I understand everything my parents said to me now. Sonic, if you leave here to go on another adventure... Remember this place.",
"Definitely. [Elise suddenly strays away for a few moments.] Elise?",
"I'm fine... Sorry. (I mustn't cry... I can't...)",
"Elise... smile.",
"Princess Elise, ruler of Soleanna... By refusing to negotiate with me, you have forced me to take drastic actions. [Amy is seen in the crowd witnessing the Egg Carrier before turning to run away.] Meet me at the specified point alone 4 o'clock today. Failure to do so on time, Will result in my leveling of this city so that nothing but ashes remain!",
"Miss Elise...!",
"I cannot allow harm to come to my people.",
"Miss Elise...!",
"It is my duty as Princess of Soleanna to go... There is no other choice.",
"You've wasted so much of my time. If you had cooperated with me earlier, I wouldn't have to do this.",
"What are you trying to do, Dr. Eggman? Why do you wish to revive the Flames of Disaster?",
"Did your parents ever disclose to you anything about Solaris? Solaris's secrets are in his eternal flames. His power... can change time, and even manipulate the fabric of time itself. I wish to obtain this power and dominate everything in this world. From the past all the way to the future!",
"You wish... to rule over... Time?",
"Yes. Truly. And the secret... It remains dormant in you, Princess. [Dr. Eggman proceeds to his ship's interface and begins inputting commands.] The Princess of Soleanna and the seven Chaos Emeralds... Once I have everything, the fate of the world will change. And one of the beautiful gems is just ahead.",
"Chaos Emerald located.",
"Finally... Now, let's go collect that Chaos Emerald.",
"You look like you're in a hurry.",
"... So what's going on?",
"Circumstances have changed. I need to rescue the Princess.",
"Huh? The engines are malfunctioning. [Elise stands up.] What's this? Stop all engines now! [There's no response. Eggman pounds on his interface in frustration and horror.] ...Why is this happening? No! We're about to crash!",
"Elise!",
"Wait, there's still a way to change this. [Sonic turns around.] If we return to an earlier point in time, we'll be able to save her.",
"I understand.",
"Chaos Control!",
"Silver. I can handle this myself. Besides, you've got somewhere to go, right?",
"You...",
"I'll make sure to change Elise's fate. And that in turn, should change your future, too. [Silver nods.] Thank you, Silver!",
"Yeah... Just save her.",
"Thrust increasing. Engine output at maximum. Course plotted. [Egg Carrier is seen preparing to depart from Aquatic Base.] Gate open. Lifting off.",
"...Why is this happening? Noooooo!!",
"Playtime's over.",
"Sonic!",
"This ship is about to crash. Too bad, Eggman.",
"I'm not finished yet!",
"Sonic!",
"Aren't you worried?",
"\"If you have time to worry, then run,\" right?",
"Nice smile!",
"This world was devastated before I was born. A harsh, bleak place, where we live in eternal darkness. Life is a struggle, and people live without hope. How did this happen? No one will answer me directly. But they always point... to the flames. [A tornado of flames swirl up before Silver. He uses a psychokinetic blast to clear the flames in front of him and they die away.] These flames. They burn away at my world destroying everything in their path. They come from a eternal life form we cannot truly defeat. The Flames of Disaster known as Iblis.",
"Silver!",
"Blaze, what's wrong?",
"He's appeared again!",
"Come on, you monster!",
"Looks like we stopped it for now.",
"But, it'll just rise up from its ashes again. [Hits a brick wall with his fist in frustration.] What's the point of all this? It'll never end.",
"Calm down, Silver.",
"[disappointed] Then tell me what we should do. How can we completely destroy Iblis?",
"...By knowing the truth, of course.",
"Just as a flower comes from a seed, or a chicken comes from an egg, everything has an origin. You need to find the being originally responsible for this catastrophe. [raises his fist]",
"Is that really the answer to our problem? [Silver points at Mephiles.] Tell me, do you know who it is?",
"To fix this present timeline, you need to change the past.",
"But, that's impossible.",
"With my help, you can, because I have the power to travel through time!",
"[Surprised] No way!",
"In order to change the past, you must eliminate the individual who has awakened Iblis. The Iblis Trigger.",
"If I eliminate that guy, will our world be saved?",
"[Nods] The Day of Disaster... Here are my records of this event. This was when Iblis was freed and his flames were released into the world.",
"And you have this person to blame.",
"I see it! So, that blue hedgehog's the Iblis Trigger?",
"Blue hedgehog...",
"I'll send us back in time to the point when the Iblis Trigger was alive.",
"Where am I? [Sees that Blaze and Mephiles are not here] Blaze? [Looks again] Blaze! [Finds that no one is here] I guess we all got separated. [Looks around] This is so unbelievable. [Sees the path ahead near a tree and looks up at it] Now I must fight for the future!",
"So this is the past... [Sees two houses near the sand and puts her hands on her hips] I hope Silver is OK. He's pretty insecure when he's alone. [Looks around and ponders] The Iblis Trigger. Blue hedgehog...",
"I've finally found him... the Iblis Trigger!",
"Now I've got you, Sonic!",
"Hey!",
"It's about time I finally caught you again! [Opens her eyes and looks at Silver in shock] Hey! You're not Sonic! [Slaps him and speaks, embarrassed] Um... I'm sorry!",
"Ah, I'm... [Sees that Sonic has vanished] Huh? Hey, where'd he go? [Looks around again] He must have run off!",
"[Goes to Silver] I'm sorry. Did you miss someone because of me?",
"Ah... it's okay. I'm sure the guy I'm looking for is still on the island. I'm sure I can still find him.",
"[Grabs Silver's hand] Well then, I'll help you!",
"What?",
"Two heads are better than one when looking for someone!",
"Hey, just wait a second!",
"[Closed up] What's your name?",
"[Pauses for a moment] ...Silver.",
"That's a nice name. I'm Amy Rose. It's nice to meet you! [Runs off with Silver, holding his hand]",
"Ah... Hey, wait!",
"Hmm... I sense Sonic's presence there. [Points out ahead while Silver walks in exhaustion] Call it my girlish intuition.",
"What am I doing?",
"[Looks at Silver] Sorry. As soon as I find Sonic, I'll help you find who you're looking for, Silver.",
"[Silver shakes his head and thinks for a moment, then looks up] This looks so beautiful.",
"What? You mean this desert?",
"Everything is so great here, isn't it? The sky is gorgeous, and everyone's happy...",
"[Looks at him in confusion] Huh?",
"[Quickly turns around] Let's go. I'll help you find who you're looking for.",
"I can't believe we haven't located Sonic yet. Gee, I wonder where he went...",
"I've been looking for you. You're the Iblis Trigger.",
"Your actions will condemn us all.",
"[Gets in front of Elise] Who are you?",
"My name is Silver. [Points at Sonic again] For the future of the world, I will destroy you!",
"Hmph! Is this a joke? How could someone like you cause the destruction of our world?",
"What do you...mean?",
"[Gets up] It doesn't matter. For the sake of the future, the Iblis Trigger must be destroyed!",
"Elise!? Wait!",
"Don't you dare turn your back on me! It's time I finally put an end to this! [Silver is about to finish him off when Amy arrives.]",
"Stop!",
"Amy?",
"[Furious] Get out of my way, Amy! This is my mission!",
"[Shakes her head] Absolutely not!",
"Thanks Amy, I appreciate it. [Runs off to find Elise]",
"Leave it to me.",
"The person you were looking for was Sonic? Were you planning to kill him?",
"That's crazy! [Points at him and accuses him] Sonic would never do that!",
"But it's true! In the near future, his actions will cause the devastation of my world. So I must...",
"No! I don't believe it. Even if that was true. If I had to choose between the world and Sonic, I would choose Sonic!",
"So this is where you are. I've been looking for you.",
"What's wrong? [Looks at him closely as he ponders]",
"[Sighs] Well, uh, Blaze. To kill someone to save the world... [Turns his head to the shore again] Is that really the right thing to do?",
"[Puts her hands on her hips again in disappointment] You're so naive. Whether it's right or wrong, I can't really say... [Turns his head to her, clueless] But what I do know is... [Crosses her arms] If we don't take this chance, the future will remain exactly as it is.",
"Since he's after Dr. Eggman, let's sneak into Eggman's base. Maybe we'll learn something new.",
"Looks like we've arrived a little too late.",
"What? Oh no!",
"That's a Chaos Emerald.",
"It's said this gem can transform your thoughts into power. Collect seven, and a miracle's supposed to happen. Keep it as a lucky charm.",
"It transforms your thoughts into power...",
"Hmm... I've been trying to find Sonic but now I think I'm in trouble.",
"Maybe I should just walk away real quietly before they spot me.",
"Oh!",
"Prisoner has escaped from Cell Block C-17. All patrolling guards, begin searching immediately.",
"[Turns to Elise] This way!",
"O... OK!",
"Prisoner has escaped from Cell Block C-17.",
"Thank you so much for rescuing me. I am so grateful!",
"[Introduces herself] I'm Amy. Amy Rose.",
"[Introduces herself] My name is Elise.",
"[Examines Elise] Elise... Wait, you're not Elise, the Princess of Soleanna, are you? I'll bet someone's already on their way to rescue you.",
"Um, yes, but someone I know said to me... \"Nothing starts until you take action.\" So I decided to heed his advice.",
"Hmm... You wouldn't happen to have some feelings for this person, would you?",
"[Embarrassed] What? No! Of course not.",
"[Interrupting] It's OK. Love changes everything. [Walks and looks up] It feels like every little moment in your life is huge! [Spreads her arms wide on the word \"huge\" and turns to Elise with sparkles around her] Doesn't it?",
"So, what does this guy look like? Have you already been on a date with him?",
"Well, no... I really haven't...",
"A one-way love? That's so cute. Come on, there's no need to be shy. Look, you're a Princess and you're super cute. That guy's the lucky one! I also have someone that I'm pursuing, too. I wish us both luck!",
"Finally, I've been waiting so patiently for you to return, Princess.",
"Mephiles...",
"Tell me. Who is the Iblis Trigger? Why does he want to destroy the world?",
"[Looks up] Why does that matter to you? [Points at Silver] Unless you complete your task, your future will remain the same... forever. [Looks at Silver, then puts his hand down] He's currently at the terminal station. It's now or never if you want this.",
"I knew it. I knew you'd return! You had to!",
"...You again.",
"This time there will be no more interruptions! [Points at Sonic] The Iblis Trigger... must die!",
"Sonic.",
"So how was your little walk, Princess?",
"Elise!",
"It's time to end this!",
"[Surprised] Who?",
"Mephiles! Why are you getting in my way?",
"[Gets up] I'm Shadow. Shadow the Hedgehog.",
"Chaos Control!",
"You...",
"Don't bother. With a Chaos Emerald's power, I control time and space. You can't break free. [Holds out the emerald]",
"I won't give up! It all depends on me! [Shrugs his shoulders] Can't lose. Not when I'm so close!",
"[Holds the emerald aloft] Chaos...",
"[Same time as Shadow] Chaos...",
"Control! [A light emerges from both emeralds, and both hedgehogs jump back from each other as it splits up.]",
"Huh?",
"[In wonder] You... induced [script error adds an \"a\"] Chaos Control.",
"I won't let anyone get in my way! I'll change the past and save the world.",
"[Shakes his head in disappointment] Mephiles isn't trying to help you create a better future... He's trying to eliminate the past.",
"[Confused] What? What are you talking about?",
"[Walks up to him] To discover what happened, it seems we must see what took place 10 years ago.",
"Follow me if you want the truth.",
"An electromagnetic pulse has just been generated! Injecting [a] decompression agent! No, the level's not dropping!",
"A spatial meltdown is inevitable! My Lord, it's too late! We've got to take shelter!",
"[Slams his fists on the machine] Why, Solaris? Why do you refuse to listen to my voice?",
"Father! [Runs up to the Duke]",
"[Surprised] Elise!",
"Is that!?",
"That flame... It's Iblis!",
"And the black shadow is the original Mephiles.",
"That's Mephiles!?",
"They're escaping!",
"We'll have to split up. I'll pursue Mephiles.",
"OK. Then leave Iblis to me!",
"[Weakly] Wait.",
"Seal it with this...",
"Hurry!",
"Hey! What are you doing? You've got to leave!",
"I have my duty. This Living Flame has been entrusted to the royal family. [Approaches Iblis] The Flames of Disaster will awaken if nothing is done! That must not happen. [The Duke sets Elise down on the altar and takes out the white Chaos Emerald, then holds it aloft and launches it upward. The Duke takes a few steps backward and prays.]",
"Eternal Sun! The Living Flame that has been entrusted to the royal family! Fall into slumber with a royal soul! [Duke lifts his hands upward, and Iblis shrinks, becoming minuscule, and vanishes into the emerald, which then injects it as a beam of light into Elise, who moves a little. Silver's psychokinesis stops and he looks in wonder. The Duke collapses on the altar, weakened and all worn out and trying to breathe. Silver looks at him as he picks up the unconscious Elise and stumbles onto him.]",
"[Weakly] I'm sorry, but... [Looks at Silver] Can you take her to a safe place?",
"That's a good girl, Elise. Remember, be brave. Don't cry, no matter what happens. Otherwise your tears will call forth the flames inside you... Become a strong queen who doesn't cry no matter what happens. And... live... happily...",
"Did you do it?",
"Yes. And you?",
"[Pauses and nods] ...Yes. The \"Flames\" are properly sealed. It's done.",
"You're going to leave it behind?",
"Yes, I already know what becomes of it in the future... [Looks at Silver, then stands up and takes out the green Chaos Emerald] It's time to return.",
"Yes... Of course...",
"Chaos Control!",
"[Mumbles] Father...",
"It's a lucky charm.",
"Blaze...",
"[Crosses her arms] What did you see?",
"[Looks down and pauses for a second] The Iblis Trigger... wasn't Sonic the Hedgehog.",
"I see...",
"They're quite noisy.",
"Yes. I heard that the Princess here left for Dr. Eggman's base in response to his earlier threat.",
"[Surprised] What if his ultimate objective was to release Iblis?",
"You look like you're in a hurry.",
"[Crosses his arms] ...So what's going on?",
"[In shock] Elise!",
"Wait, there's still a way to change this.",
"If we return to an earlier point in time, we'll be able to save her.",
"I understand.",
"Chaos Control!",
"Silver!",
"I can handle this myself. Besides, you've got somewhere to go, [script error adds a \"to\"] right?",
"[Amazed] You...",
"I'll make sure to change Elise's fate. [Raises a fist and looks at Silver before continuing] And that in turn should change your future, too.",
"[Gives a thumb up] Thank you, Silver!",
"Yeah... Just save her.",
"I know how to save our world, now. We don't have to change the past. I'm sure of it.",
"So you have a plan?",
"Well then, let's hurry. I sense his flames.",
"C'mon, Iblis! This time I'll finally stop you!",
"[Holding both Chaos Emeralds] Chaos Emeralds, lend me your power! Eternal Sun! The Living Flame that has been entrusted to the royal family! Fall into slumber with my soul, Iblis! You cursed Flames of Disaster!",
"No! Why won't it accept me as the vessel?",
"Blaze!",
"I'll take Iblis.",
"Don't worry. My soul is already alit with flames. I will be accepted.",
"Come on, make it quick. Use your Chaos Control... to stop time. Then... seal us into a different dimension.",
"[In shock] No! I can't do that to you!",
"[Looks at him] Didn't we already go through this? We agreed to save the world at any price! [Silver is stunned again, then tries to use Chaos Control, but can't do it.]",
"[Saddened] I can't! I wouldn't know what to do without you! You've fought alongside me to save the world... You're my friend... Right?",
"[Disappointed] You're still so naive. But... [Turns to face Silver] I... I've always liked that about you.",
"Blaze!",
"Good luck, Silver.",
"Transmission from HQ. There's an SOS coming from Dr. Eggman's Base. Our last communication with our agent was 26 hours ago. We expect an immediate rescue, Shadow The Hedgehog.",
"Understood. Initiating the mission now [Teleports away using Chaos Control]",
"Don't you want to know what this is?",
"My assignment was to rescue you, nothing more",
"Fine. With you it's always business",
"It's seems they don't want us to leave.",
"[Grunts] Let's get this over with.",
"Ah, Soleanna, the city of water. It has a constitutional monarchy, you know. The primary industries are tourism and crafting precision machinery. The current sovereign is Princess Elise the Third.",
"Why does Eggman's base lead to an odd place like this?",
"How should I know? I just followed my orders and retrieved the Item. Anyway, I have a little favor to ask of you. Could you escort me to GUN rendezvous point?",
"Where's the rendezvous point?",
"[Point to map on computer screen] It's the ancient castle of Soleanna, in Kingdom Valley.",
"The former king of Soleanna used to reside in this castle. But a major accident occurred 10 years ago, and no one's lived here since.",
"Accident?",
"I heard a prototype energy engine failed, which caused the accident. I think the name of the plan was...",
"The Solaris Project. It was an ambitious project named after their eternal sun god.",
"Doctor!",
"It's been a while, my dear Rouge. And of course, Shadow. Now, if you'd be so kind as to hand back the Scepter of Darkness you took from me.",
"No......!",
"Shadow!",
"It's no use! Pull back, pull back, pull back! [Flies away in the Egg Mobile.]",
"What? His shadow...",
"[Laughs] Oh, how ironic fate can be! I would never have believed I would be resurrected through your shade! I thank you Shadow The Hedgehog! [Bows]",
"Who are you? How do you know my name?",
"I'm Mephiles. Mephiles the Dark. [Walks towards Shadow] What, did you forget me? I owe much to you Shadow. Oh, yes. [Forms a purple orb in his hand] What you gave to me, I now return to you! A one-way ticket to oblivion. ",
"What is this place?",
"It seems we've been teleported to another location.",
"Well, let's find out where we are. [Runs away]",
"Mephiles.... [Screen turns grayscale] Who is he? [Follows Rouge]",
"I'm in... I've pinpointed our location, It's... [Taps on keyboard and screen appears] No... that's not possible... We're still in the Doctor's base. But how can that be? Wait there's no doubt now!",
"So, It's not where we are...",
"It appears we've gone through time... doesn't it?",
"Yes... Approximately 200 years. Maybe more, depending on when this database was last updated. Well, at least we know we've arrived in the future. That means this Mephiles character has the power to control time.",
"His power feels very similar to my own Chaos Control. But...",
"Boy, do I feel dizzy ... [Looks around] Where are we?",
"Oh, look who's here! I didn't expect to see you guys.",
"Rouge! Shadow!",
"Hi. Long time no see!",
"This is the distant future, far removed from our own timeline.",
"The future? Then that means Eggman's machine can control time!",
"Eggman's got some nerve dropping us here.",
"[Kicks a rock] Now. How can we get back to our own time?",
"You need a space-time rift, but this requires a lot of energy.",
"I see. You mean using your Chaos Control will...",
"Yes, but that alone is insufficient.",
"Okay Shadow. It looks like we need to work together.",
"My precious Chaos Emerald. You are all so beautiful. Your mysterious brilliance...",
"Omega what's he doing here?",
"[Takes a look at Omega's back display] It seems he's in standby mode.",
"What could have possibly happened to create this future? [Receives a message from Sonic and his friends] Yes, this is Rouge. Understood. We'll be there in a minute. It looks like Sonic and his friends have found something, too. Let's go. It's not like we can do anything for him now.",
"Yeah.",
"You guys are so slow. Look. [Shows the green Chaos Emerald]",
" A Chaos Emerald! You've already found one!",
"Well now... I may not look It, but I'm a real treasure hunter. Unlike a certain echidna I know.",
"[Gets up in Rouge's face] What? [Scoffs and walks away]",
"Have you guys discovered anything?",
"Um, yeah. [Points into the distance] I received a signal indicating there's a Chaos Emerald here, but...",
"You mean we've got to go through there?",
"[Gets up in Rouge's face] If you don't like it, you can stay here.",
"You've got to be kidding! [Knuckles walks away]",
"Don't be late.",
"[Walks away] Same to you.",
"I've found a Chaos Emerald!",
"Don't touch it!",
"What? What's this?",
"[Crosses the Emeralds] Chaos Control!",
"Shadow? Shadow! [Finds the Chaos Emerald] Shadow... And he doesn't have a Chaos Emerald anymore...",
"Agent Rouge? Report your status immediately. Have you retrieved the Scepter of Darkness?",
"Well... I\"ll provide a full report shortly. Right now. I have a priority situation to deal with. I need to contact E123 Omega immediately. [Smiles]",
"This is a charming little place. [Omega notices Rouge] Hi, long time no see.",
"Rouge The Bat. ",
"Situation understood. What would you like me to do?",
"[Holds out the green Chaos Emerald] Take this, and deliver it to Shadow.",
"Shadow Support. External access no longer permitted. Confirmed.",
"I'm counting on you.",
"So, decided to void your return ticket now, did you?",
"Why are you here? Did you ruin this world?",
"The answer's yes and no. Perhaps it's better to show you.",
"Yes that's you. After the world was devastated by Iblis' flames what do you think happened? A search for the guilty. What did this you may ask? Humanity wasn't just jealous of your power. They feared it. They used this incident as an excuse to hunt you down. Come with me, Shadow. Let us punish this foolish world of humanity. It is only fair to give back what was intended for you. You have every right to want justice.",
"That's absurd. Whatever it is you want to do, you can do it alone.",
"You forgive humanity this folly then?",
"I determine my own destiny.",
"Omega!",
"Now is the designated time. [Retracts arm cannon] I shall assist.",
"[Grunts]",
" Mephiles!",
"It appears Mephiles is no longer here. I will assist in pursuing him.",
"Hi. It seems like Eggman's machines are looking for you. What did you do this time?",
"Nothing. Their target is probably Mephiles.",
"What is Eggman up to? Who is Mephiles?",
"I'm gonna ask him directly. [Starts walking away]",
"Hey, wait a sec!",
"I can handle this alone. You keep track of Mephiles. [Walks away from Rouge and Omega]",
"Hmph. He finally shows up again and then he leaves before even saying, \"Hello.\" Well, it seems his little trip hasn't changed him. [Talks on wrist communicator] This is Rouge. GUN HQ? Yes, pull all available data on an item called the Scepter of Darkness for me.",
"Wouldn't the door have been easier? So, what do you want now?",
"Who is Mephiles? And why are you trying to capture him?",
"If you want to know, you should go find him yourself. But here's a hint... It's all linked to the Soleanna disaster 10 years ago.",
"The Solaris Project.",
"Indeed. When you capture Mephiles, you must bring him to me. Then I'll tell you the truth about Solaris.",
"I knew it... I knew you'd return! You had to! ",
"...You again.",
"This time there will be no more interruptions! The Iblis Trigger must die!",
"Sonic...",
"So how was you little walk, Princess? [Appears and grabs Elise with the Egg Mobile before flying away.]",
"Elise!",
"[Strengths his hold on Sonic] It's time to end this! ",
" Who? Mephiles! Why are you getting in my way?",
"I'm Shadow. Shadow The Hedgehog.",
"[Pulls out the green Chaos Emerald] Chaos Control! [Time is slowed down and Shadow kicks Silver on the head.]",
"[Gets back up] You...",
"Don't bother. With a Chaos Emerald's power, I control time and space. You can't break free.",
"I won't give up! It all depends on me! Can't lose... Not when I'm so close! [Pulls out the blue Chaos Emerald and runs at Shadow with a shout]",
"Chaos...",
"Chaos...",
"[Both step around the other and hold up their respective Chaos Emeralds, their hands coming into contact] ...Control!",
"You... induced a Chaos Control.",
"I won't let anyone get in my way! I'll change the past and save the world!",
"Mephiles isn't trying to help you create a better future... He's trying to eliminate the past.",
"What?  What are you talking about?",
"To discover what happened, it seems we must see what took place 10 years ago. Follow me if you want the truth. [Jumps into the Time-Space rift.]",
"An electromagnetic pulse has just been generated! Injecting decompression agent! No, the level's not dropping! A spatial meltdown is inevitable! My Lord, it's too late! We've got to take shelter!",
"Why, Solaris? Why do you refuse to listen to my voice?",
"[Comes running] Father!",
"Elise! ",
"Is that? That flame... It's Iblis!",
"And the black shadow is the original Mephiles.",
"That's Mephiles!? [Mephiles and Iblis flee] They're escaping!",
"We'll have to split up, I'll pursue Mephiles.",
"OK. Then leave Iblis to me!",
"Wait. Seal it with this... [Holds out the Scepter of Darkness to Shadow]",
"Hurry! ",
"[Holds up the green Chaos Emerald] Chaos Control!",
"...What? ...Stop!",
"Who...... Who are... you?",
"I'm Shadow. Shadow The Hedgehog.",
"Shadow... Your face... Your form... I will remember. Your death... Certain... You... will die!",
"Did you do it?",
"Yes. And you?",
"...Yes. The \"Flames\" are properly sealed. It's done.",
"You're going to leave it behind?",
"Yes, I already know what becomes of it in the future. It's time to return.",
"Yes... Of course...",
"[Both pull out their Chaos Emerald] Chaos Control!",
"You're back sooner than I expected. Omega is still in pursuit of Mephiles. So, where's the kid? What did you find 10 years ago?",
"I need you to access GUN's database.  Specifically, find out what materials the Scepter of Darkness was made from.",
"Sure. But you haven't answered my question yet!",
"I found the means to seal Mephiles.",
"This only proves you were created to stop Shadow, the ultimate life form. Don't tell me you didn't know. You may have been programmed by humanity, but what you did to Shadow in the future, that was your...",
"What just happened?",
"Shadow. The one that defeats and seals you in the future... is me.",
"It's... It's so unfair! Shadow's always here to defend the world! Despite that!",
"Eventually, when something or someone is seen as too powerful... It is seen as a threat, and then the world becomes its enemy.",
"Shadow... Even if you believe everyone in the world will be against you. Know that I'll always remain by your side. Remember that.",
"[Stops walking] I will. [Resumes walking]",
"Mephiles appears to have headed for those ruins. He's probably looking for the Chaos Emerald that's supposed to be there.",
" There's no doubt in my mind. his movement shows he's seeking any Chaos Emerald he can find. Supposedly, he needs one in order to join with Iblis again.",
"I will seal him before that.",
"Mephiles!",
"[Holding the yellow Chaos Emerald] I was expecting you sooner. As you must know, you're already too late. But there's still time for you to change your mind. Join me, Shadow. Let us teach this world a lesson and rewrite the future.",
"Don't try to deceive me.",
"What?",
"You have no desire for revenge. You only crave destruction. Your only lust is to fuel Iblis until there is nothing left of time itself.",
"It's a pity, Shadow The Hedgehog. [Levitates the yellow Chaos Emerald into the air] Truly a shame that you wish to go against me!",
"It's destroyed!",
"[Swirls into a solid figure in the air] The \"I\" of now absorbed your power through your shadow in the past. What may have worked 10 years ago, no longer does!",
"You must realize now that you cannot hope to stop me with your limited power.",
"So you say...",
"It's futile. The world will betray you. Why fight at all? Why risk your life for those who will persecute you later?",
"[Removes his gold rings] If the world chooses to become my enemy, I will fight like I always have!",
"[Shakes Sonic] Sonic! Sonic!",
"[Rolls Sonic over] Sonic?",
"Yes, Elise... Don't cry, no matter what happens.",
"Oh... no. [Screen turns back to normal] Nooooooooo! [Elise cries and Iblis bursts out from her.]",
"[Laughs] Finally, the seal is broken! At long last, I'll be able to join with you! Iblis! Now, Chaos Emerald! It's time for the final curtain call! [Levitates the purple Chaos Emerald into the air]",
"What is this?",
"Where are we? What's going on?",
"Is this because of that light?",
"The Chaos Emerald has disappeared...",
"Silver?",
"What are doing here? This is all so confusing...",
"It's all because of Solaris.",
"It seems we were all caught by the spatial distortion. Iblis' seal has been broken. Due to Mephiles manipulation.",
"Sonic?",
"No... You don't think...",
"Sonic!",
"Mephiles played us all for fools! His plan all along was to cause the Princess to be consumed with despair that she'd cry.",
"So that's why he wanted me to kill Sonic before...",
"Solaris!",
"This creature will consume all existing timelines. And time itself will collsapse and disappear into nothingness.",
"The instability of time caused this time-space rift.",
"It won't remain for much longer.",
"We've no time to waste. We've got to defeat it now!",
"No, it is a transcendent life form that exists in the past, present and future. Defeating it here, now, would do nothing.",
"No, I won't give up. There has to be a way. If you say it exists in the past, present and future, I'll destroy them all at once!",
"Certainly, it might have been possible, if he was still alive.",
"Sonic! Sonic!",
"Sonic...",
"What's the matter?",
"I feel... Sonic's presence in the wind. I don't think he's dead yet! I'm sure of it. It's not too late!",
"Of course! Let's call him back with power of the Chaos Emeralds! Focus your thoughts on using its power to perform this miracle... [Walks up to Elise] You can do it, Princess!",
"I can?",
"You were the vessel that was used to seal Iblis. You should be able to use the gems' power to rescue Sonic's soul!",
"[Nods] I'll...Do it!",
"[Adjusts his glasses into a radar] Solaris flung the Chaos Emeralds to the distant corners of this distorted world.",
"To collect them all in time, we'll have to split up!",
"I'll go, too! Because it's for Sonic! So Elise... Watch over him!",
"Oh Chaos Emeralds, gems of miracles. Please heed my call. [Chaos Emeralds start glowing brighter] I wish to save this world. I wish to cleanse my father's sin. And, I wish to talk to Sonic... once again! [The Chaos Emeralds and still lifeless Sonic start levitating into the air.] You have given me so many things. Now it is my time to return the favor. I care not what happens to me. But please heed my voice. Sonic, come back! To me... To us!",
"Thank you, Elise.",
"Did you destroy it?",
"...No. That is the true Solaris.",
"Look, Elise. This is Solaris, the flame of hope.",
"It's so beautiful...",
"When the flame has grown large enough, our world will change. Solaris will allow us to control time and move through history. People will be able to rectify past mistakes and avoid bitter fate.",
"Will we be able to see momma?",
"Yes, Elise. We'll both be able to see your mother once again.",
"This is where everything began. Who knew such a tiny flame could bring such devastation? [Takes out Solaris and its candleholder] If we put out this flame, Solaris will never exist, And then we'll never have to worry about the Flames of Disaster, right?  But our encounter... You and I will never meet. It will never have happened. I... To tell the truth, I don't care what happens to the world! [Cries]",
"Elise. Just smile.",
"Miss Elise?",
"It felt like... [like] someone was calling me.",
"I'm sure. It's just the wind.",
"Of course. But it felt so familiar somehow..."
]